In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("/Users/armanshaikh/Desktop/pandas-fundamentals/practice_questions/employees_value_counts.csv")

In [4]:
df

    EmpID    Name Department    City  Gender  Salary  Experience
0     101   Arman         IT   Delhi    Male   60000           2
1     102    Riya         HR  Mumbai  Female   45000           1
2     103   Kunal         IT   Delhi    Male   72000           5
3     104   Sneha    Finance    Pune  Female   68000           4
4     105  Vikram         HR  Mumbai    Male   50000           2
5     106   Pooja         IT   Delhi  Female   58000           3
6     107   Rahul    Finance    Pune    Male   75000           7
7     108    Neha         HR   Delhi  Female   52000           2
8     109   Arjun         IT  Mumbai    Male   40000           1
9     110  Simran    Finance    Pune  Female   69000           6
10    111   Kabir         IT   Delhi    Male   62000           3
11    112   Aisha         HR  Mumbai  Female   48000           2
12    113   Rohit         IT     NaN    Male   61000           3
13    114    Sara    Finance    Pune  Female   70000           5

In [5]:
# Find count of employees per department.
df["Department"].value_counts()

Department
IT         6
HR         4
Finance    4
Name: count, dtype: int64

In [6]:
# Find count of employees per city.
df["City"].value_counts()

City
Delhi     5
Mumbai    4
Pune      4
Name: count, dtype: int64

In [7]:
# Find gender distribution.
df["Gender"].value_counts()

Gender
Male      7
Female    7
Name: count, dtype: int64

In [8]:
# Find department distribution in percentage.
df["Department"].value_counts(normalize=True) *100

Department
IT         42.857143
HR         28.571429
Finance    28.571429
Name: proportion, dtype: float64

In [9]:
# Include missing values while counting city.
df["City"].value_counts(dropna=False)

City
Delhi     5
Mumbai    4
Pune      4
NaN       1
Name: count, dtype: int64

In [10]:
# LEVEL 2 — INTERMEDIATE
# Find top 2 most common departments.
df["Department"].value_counts().head(2)

Department
IT    6
HR    4
Name: count, dtype: int64

In [11]:
# Find least common city.
df["City"].value_counts().tail(1)

City
Pune    4
Name: count, dtype: int64

In [12]:
# Find how many employees earn > 60000 salary (using filtering + value_counts).
a = df[df["Salary"]>60000]
a["Department"].value_counts()

Department
Finance    4
IT         3
Name: count, dtype: int64

In [13]:
# another methods
# len(a) 
# (df["Salary"] > 60000).sum()
# a.shape[0]

In [14]:
df[df["Salary"] > 60000]["Salary"].value_counts()

Salary
72000    1
68000    1
75000    1
69000    1
62000    1
61000    1
70000    1
Name: count, dtype: int64

In [15]:
df

    EmpID    Name Department    City  Gender  Salary  Experience
0     101   Arman         IT   Delhi    Male   60000           2
1     102    Riya         HR  Mumbai  Female   45000           1
2     103   Kunal         IT   Delhi    Male   72000           5
3     104   Sneha    Finance    Pune  Female   68000           4
4     105  Vikram         HR  Mumbai    Male   50000           2
5     106   Pooja         IT   Delhi  Female   58000           3
6     107   Rahul    Finance    Pune    Male   75000           7
7     108    Neha         HR   Delhi  Female   52000           2
8     109   Arjun         IT  Mumbai    Male   40000           1
9     110  Simran    Finance    Pune  Female   69000           6
10    111   Kabir         IT   Delhi    Male   62000           3
11    112   Aisha         HR  Mumbai  Female   48000           2
12    113   Rohit         IT     NaN    Male   61000           3
13    114    Sara    Finance    Pune  Female   70000           5

In [16]:
# Find count of employees by Department + Gender combination.
df.value_counts(["Department","Gender"])

Department  Gender
IT          Male      5
Finance     Female    3
HR          Female    3
Finance     Male      1
HR          Male      1
IT          Female    1
Name: count, dtype: int64

In [17]:
# Convert value_counts output into DataFrame.
df["Department"].value_counts().reset_index(name="count")

  Department  count
0         IT      6
1         HR      4
2    Finance      4

In [18]:
# Find which department company spends most salary on
# Combine groupby + count logic thinking
# df.groupby("Department")["Salary"].sum()
# pd.pivot_table(df,index="Department",values="Salary",aggfunc="sum").sort_index(ascending=False).head(1)
pd.pivot_table(df,index="Department",values="Salary",aggfunc="sum").sort_index(ascending=False).idxmax()

Salary    IT
dtype: object

In [19]:
# Find which city has most IT employees.
# df.groupby("City")["Name"].count().idxmax()
pd.pivot_table(df,index="City",values="Name",aggfunc="count").idxmax()

Name    Delhi
dtype: object

In [20]:
# Find department distribution only for employees with experience ≥ 3.
df[df["Experience"]>=3]["Department"].value_counts(normalize=True)*100

Department
IT         50.0
Finance    50.0
Name: proportion, dtype: float64

In [21]:
# using loc method
df.loc[df["Experience"] >= 3, "Department"].value_counts(normalize=True)*100

Department
IT         50.0
Finance    50.0
Name: proportion, dtype: float64

In [22]:
# using crosstab method
pd.crosstab(df[df["Experience"] >= 3]["Department"], columns="Count",normalize=True)*100

col_0       Count
Department
Finance      50.0
IT           50.0

In [23]:
# Find % of male vs female employees.
df["Gender"].value_counts(normalize=True)*100

Gender
Male      50.0
Female    50.0
Name: proportion, dtype: float64

In [24]:
pd.crosstab(df["Gender"],columns="Percentage",normalize=True)*100

col_0   Percentage
Gender
Female        50.0
Male          50.0

In [25]:
df2= pd.read_csv("/Users/armanshaikh/Desktop/pandas-fundamentals/practice_questions/orders_value_counts.csv")

In [26]:
df2

    OrderID    City     Category Payment_Method Order_Status
0         1   Delhi  Electronics            UPI    Delivered
1         2  Mumbai     Clothing           Card    Delivered
2         3   Delhi  Electronics            COD    Cancelled
3         4    Pune     Clothing            UPI    Delivered
4         5  Mumbai  Electronics           Card     Returned
5         6   Delhi      Grocery            UPI    Delivered
6         7    Pune      Grocery            COD    Delivered
7         8  Mumbai     Clothing            UPI    Delivered
8         9   Delhi  Electronics           Card    Delivered
9        10    Pune  Electronics            UPI    Cancelled
10       11   Delhi     Clothing            COD    Delivered
11       12  Mumbai      Grocery            UPI    Delivered

In [27]:
# Most used payment method.
df2["Payment_Method"].value_counts()

Payment_Method
UPI     6
Card    3
COD     3
Name: count, dtype: int64

In [31]:
# Order status distribution (Delivered / Cancelled / Returned).
df2["Order_Status"].value_counts()

Order_Status
Delivered    9
Cancelled    2
Returned     1
Name: count, dtype: int64

In [44]:
# Which city has most delivered orders.
df2[df2["Order_Status"]=="Delivered"]["City"].value_counts().idxmax()

'Delhi'

In [48]:
# Find % of each product category sold.
df2[df2["Order_Status"]=="Delivered"]["Category"].value_counts(normalize=True)*100

Category
Clothing       44.444444
Grocery        33.333333
Electronics    22.222222
Name: proportion, dtype: float64

In [51]:
# Find most common payment method for Delhi city only.
df2[df2["City"]=="Delhi"]["Payment_Method"].value_counts()

Payment_Method
UPI     2
COD     2
Card    1
Name: count, dtype: int64

In [63]:
# Create summary report:

# Find:
#  Most common Category
#  Most common city
#  Most common payment method
#  Most common order status

summary_report = {
    "category": df2["Category"].value_counts().idxmax(),
    "city": df2["City"].value_counts().idxmax(),
    "payment_method": df2["Payment_Method"].value_counts().idxmax(),
    "order_status": df2["Order_Status"].value_counts().idxmax()
}
summary_report

{'category': 'Electronics',
 'city': 'Delhi',
 'payment_method': 'UPI',
 'order_status': 'Delivered'}

In [66]:
report = pd.DataFrame(summary_report.items(),columns=["most common","result"])

In [67]:
report

      most common       result
0        category  Electronics
1            city        Delhi
2  payment_method          UPI
3    order_status    Delivered

In [70]:
# Find data imbalance:
# Which department dominates dataset?
df2["Category"].value_counts().idxmax()

'Electronics'

In [75]:
# Detect missing data using value_counts.
df2.isna().sum()

OrderID           0
City              0
Category          0
Payment_Method    0
Order_Status      0
dtype: int64

In [ ]:
# df.info()
# df.isna().sum()

EmpID         0
Name          0
Department    0
City          1
Gender        0
Salary        0
Experience    0
dtype: int64